# Walmart Sales Exploration

### Fetching dataset from kaggle using python's kaggle api

In [4]:
import kaggle
!kaggle datasets download -d najir0123/walmart-10k-sales-datasets

Dataset URL: https://www.kaggle.com/datasets/najir0123/walmart-10k-sales-datasets
License(s): MIT

### Unzipping fetched zip file to dataset folder in current directory

In [6]:
import zipfile

with zipfile.ZipFile("walmart-10k-sales-datasets.zip", 'r') as zip_ref:
    zip_ref.extractall('./dataset/')  # Extracts to a specified folder

### Reading sales csv using pandas

In [73]:
import pandas as pd

data = pd.read_csv('./dataset/Walmart.csv')
data.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

---
---

## Undesrtanding Data

In [74]:
data.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [75]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [76]:
#Counting uniques in each column
data.nunique()

invoice_id        10000
Branch              100
City                 98
category              6
unit_price         1008
quantity             10
date               1460
time               1001
payment_method        3
rating               62
profit_margin         6
dtype: int64

In [77]:
#Counting all duplicate entries
data.duplicated().sum()

np.int64(51)

In [78]:
data.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

---
---

## Cleaning the Data

In [79]:
# Dropping Duplicate entries
data.drop_duplicates(inplace=True)

- The dollar sign ($) in unit_price can cause issues when treating the column as numerical data. Hereâ€™s what it means and how to fix it:

ðŸ”¹ Problem:<br>
The unit_price column is stored as a string (object type) instead of a numerical format (float or int).<br>
This can cause errors when performing mathematical operations like sum, mean, or sorting.

In [80]:
data.head(3)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33

In [81]:
# Changing Data type and removing dollar sign
data['unit_price'] = data['unit_price'].str.replace('$','').astype('float')

In [82]:
data['unit_price'].dtype

dtype('float64')

In [95]:
# Changin Data type of date colunm to datetime
data['date'] = pd.to_datetime(data['date'])
data['date'].dtype

dtype('<M8[ns]')

In [84]:
# Renaming columns for better analysis in SQL
data.rename(columns={'City': 'city', 'Branch': 'branch'}, inplace=True)
data.head(2)

,invoice_id,branch,city,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,2019-01-05,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,2019-03-08,10:29:00,Cash,9.6,0.48

---

### Handling Missing Data

In [85]:
data.isnull().sum()

invoice_id         0
branch             0
city               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

- Dataset size (10,051 records) and only 31 values (0.3%) are missing in unit_price and quantity, dropping them because:<br>
âœ… The missing data is very small, so removing 31 rows wonâ€™t impact analysis.<br>
âœ… unit_price and quantity are key numerical fields, and filling them incorrectly could distort sales/profit calculations.

In [86]:
data.dropna(inplace = True)
data.isnull().sum()

invoice_id        0
branch            0
city              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

---

### Deriving new columns (total and profit)

In [87]:
data['total'] = data['unit_price'] * data['quantity']
data['profit'] = data['total'] * data['profit_margin']
data.head()

,invoice_id,branch,city,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total,profit
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,2019-01-05,13:08:00,Ewallet,9.1,0.48,522.83,250.9584
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,2019-03-08,10:29:00,Cash,9.6,0.48,76.40,36.6720
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,2019-03-03,13:23:00,Credit card,7.4,0.33,324.31,107.0223
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,2019-01-27,20:33:00,Ewallet,8.4,0.33,465.76,153.7008
4,5,WALM013,Irving,Sports and travel,86.31,7.0,2019-02-08,10:37:00,Ewallet,5.3,0.48,604.17,290.0016

---

### Dropping unnecessary columns

In [88]:
data.drop(columns=['unit_price','profit_margin'],inplace=True)
data.head()

,invoice_id,branch,city,category,quantity,date,time,payment_method,rating,total,profit
0,1,WALM003,San Antonio,Health and beauty,7.0,2019-01-05,13:08:00,Ewallet,9.1,522.83,250.9584
1,2,WALM048,Harlingen,Electronic accessories,5.0,2019-03-08,10:29:00,Cash,9.6,76.40,36.6720
2,3,WALM067,Haltom City,Home and lifestyle,7.0,2019-03-03,13:23:00,Credit card,7.4,324.31,107.0223
3,4,WALM064,Bedford,Health and beauty,8.0,2019-01-27,20:33:00,Ewallet,8.4,465.76,153.7008
4,5,WALM013,Irving,Sports and travel,7.0,2019-02-08,10:37:00,Ewallet,5.3,604.17,290.0016

## Loading data to Database

In [98]:
import sqlalchemy as sal
engine = sal.create_engine('mssql://DESKTOP-TFUC48Q/EDA_DB?driver=ODBC+DRIVER+17+FOR+SQL+SERVER') 
conn = engine.connect()

In [97]:
data.to_sql('walmart_sales',con = conn,index=False, if_exists = 'append')

89

#### Also loading to new csv.

In [93]:
data.to_csv('./dataset/walmart_clean.csv')

## Conclusion ðŸ“Š
In this notebook, we cleaned, processed, and optimized the Walmart sales dataset for analysis. Key steps included:

- âœ… Handling missing values (dropped or imputed).
- âœ… Removing duplicates and correcting data types.
- âœ… Deriving new columns for better insights and dropping unnecessary ones.
- âœ… Loading the cleaned dataset into a database for SQL-based analysis.

Next Steps ðŸš€
Perform EDA through SQL queries and visualization in separate notebooks to extract deeper insights.